student_id = ""
f_name = ""
l_name = ""
m_name = ""
name =  ""
hw_list = list()
pa_list = list()
list_visit = list()

#TODO: zaprashivaem  id
# #TODO: zaprashivaem      fio
# proverim  cto be fio he soderjit цифры т проюелы
# Если Фио не корекктно то оповещвем и заново запросить
# ФИО должно начинаться с большой буквы - применять   title       
# TODO: ьсоздаьть меню - while True
# TODO:  Пункты меню
# 1. Show student data
#   Student ID: <student_id>  
#   full name: <l_name> <f_name><m_name>  
# Homework:
# <position>.  <grade_or_minus>
# 
# Practical tasks:
# <position>.  <grade_or_minus>
# 
# Visit:
#  <position>, <present_or_absent>   
#  
#TODO 2. Show student starts
#dz i pz ne ucastvuyut v vechesleniyem
# нужно будет посчитать количество оценок которые не равны "-"" потом использов
#  ФИО;
#- общая средняя оценка по всем выполненным ДЗ и ПЗ;  
#- средняя оценка за ПЗ;
#- количество выполненных ПЗ и общее количество ПЗ;
#- процент выполненных ПЗ;
#- средняя оценка за ДЗ;
#- количество выполненных ДЗ и общее количество ДЗ;
#количество выполненных
#- процент выполненных ДЗ;
#- количество посещённых занятий и общее количество занятий;
#- процент посещений.       
# 
# TODO 3.  Chance full name
#Запрсить что конкреино пользователь хочет изменить 1 2 3
# Запросить фамилию - проверяем точно также как наверху
# запрорсить имя - проверяем точно также как наверху
#  отчество - проверяем точно также как наверху
# 
#TODO 4. Add HW    
# Условимся что - означает задание которое не оцененщ
# hw_list.append("-") 
# 
# TODO 5.grade HW  
# Запрсить номер задание который лежит в hw_list
# проверить номер задание на границы (допустимые от1 до len (hw_list))
# Если номер в порядке запросить оценку
# Проверять оценку га границе   допустимые целые от 1 до 12 включительно
#Если границы в порядке  то изменяем на новую оценку по индексу      позиция -1
# 
# TODO 6. Delete HW grade
# Запррсить номер задания который лежит в hw_list
# Проверить номер задания на границы     допустимые от 1 до len(hw_list)
#Ecli номер в порядке удаляем по  индексу    позиция - 1
#TODO: для PA все аналогично 7 8 9 
# 
# TODO: 10. Add visit
#показать подменю с пунктами 1 и 2     где  1 - present. 2 -absent 
# Запрашиваем выбор пункта
# В любом верном пункте добавляем в list_visit present or absent
#TODO: 11. Change visit
# Запрвшиваем  номер посещкения  который лежит в  list_visit   
# Проверяем номер на границы    допустимые от 1 до лен list_visit  включительные
# Если номер посещения в порядке    то показать подменю с пугктами 1 и 2   где  1 - present. 2 -absent
# Запрашмвае5м выбор пункта
# В любом верпном пунтке по указанному индексу   позиция - 1       заменяем на   - present  -absent  
# 
#TODO: 12.                                                         